thibautldz/BLE_Scanner/STM32_WPAN/App/app_ble.c
/* Private function prototypes -----------------------------------------------*/
static void BLE_UserEvtRx( void * pPayload );
static void BLE_StatusNot( HCI_TL_CmdStatus_t status );
static void Ble_Tl_Init( void );
static void Ble_Hci_Gap_Gatt_Init(void);
static const uint8_t* BleGetBdAddress( void );
static void Scan_Request( void );
static void Connect_Request( void );
static void Connect_Request_Selected_Addr( void );
static void Switch_OFF_GPIO( void );
static void rx_usartCallBack( void );
/* USER CODE BEGIN PFP */
static void rx_usartCallBack( void )
{
	UTIL_SEQ_SetTask(1<<CFG_TASK_CONN_DEV_SELECT_ID, CFG_PRIO_NBR);
}
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/* Functions Definition ------------------------------------------------------*/
void APP_BLE_Init( void )
{
/* USER CODE BEGIN APP_BLE_Init_1 */

/* USER CODE END APP_BLE_Init_1 */
  SHCI_C2_Ble_Init_Cmd_Packet_t ble_init_cmd_packet =
  {
    {{0,0,0}},                          /**< Header unused */
    {0,                                 /** pBleBufferAddress not used */
    0,                                  /** BleBufferSize not used */
    CFG_BLE_NUM_GATT_ATTRIBUTES,
    CFG_BLE_NUM_GATT_SERVICES,
    CFG_BLE_ATT_VALUE_ARRAY_SIZE,
    CFG_BLE_NUM_LINK,
    CFG_BLE_DATA_LENGTH_EXTENSION,
    CFG_BLE_PREPARE_WRITE_LIST_SIZE,
    CFG_BLE_MBLOCK_COUNT,
    CFG_BLE_MAX_ATT_MTU,
    CFG_BLE_SLAVE_SCA,
    CFG_BLE_MASTER_SCA,
    CFG_BLE_LSE_SOURCE,
    CFG_BLE_MAX_CONN_EVENT_LENGTH,
    CFG_BLE_HSE_STARTUP_TIME,
    CFG_BLE_VITERBI_MODE,
    CFG_BLE_LL_ONLY,
    0}
  };

  /**
   * Initialize Ble Transport Layer
   */
  Ble_Tl_Init( );

  /**
   * Do not allow standby in the application
   */
  UTIL_LPM_SetOffMode(1 << CFG_LPM_APP_BLE, UTIL_LPM_DISABLE);

/**
   * Register the hci transport layer to handle BLE User Asynchronous Events
   */
  UTIL_SEQ_RegTask( 1<<CFG_TASK_HCI_ASYNCH_EVT_ID, UTIL_SEQ_RFU, hci_user_evt_proc);

  /**
   * Starts the BLE Stack on CPU2
   */
  SHCI_C2_BLE_Init( &ble_init_cmd_packet );

  /**
   * Initialization of HCI & GATT & GAP layer
   */
  Ble_Hci_Gap_Gatt_Init();

  /**
   * Initialization of the BLE Services
   */
  SVCCTL_Init();

  /**
   * From here, all initialization are BLE application specific
   */
  UTIL_SEQ_RegTask( 1<<CFG_TASK_START_SCAN_ID, UTIL_SEQ_RFU, Scan_Request);
  UTIL_SEQ_RegTask( 1<<CFG_TASK_CONN_DEV_1_ID, UTIL_SEQ_RFU, Connect_Request);
  UTIL_SEQ_RegTask( 1<<CFG_TASK_CONN_DEV_SELECT_ID, UTIL_SEQ_RFU, Connect_Request_Selected_Addr);

  /**
   * Initialization of the BLE App Context
   */

      BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;

    /*Radio mask Activity*/
#if (OOB_DEMO != 0)
  aci_hal_set_radio_activity_mask(0x0020);
#endif
  /**
   * Initialize P2P Client Application
   */
  P2PC_APP_Init();

#if (OOB_DEMO != 0)
  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &(BleApplicationContext.SwitchOffGPIO_timer_Id), hw_ts_SingleShot, Switch_OFF_GPIO);
#endif

#if (OOB_DEMO == 0)
  /**
   * Start scanning
   */
  UTIL_SEQ_SetTask(1 << CFG_TASK_START_SCAN_ID, CFG_SCH_PRIO_0);
#endif
/* USER CODE BEGIN APP_BLE_Init_2 */

/* USER CODE END APP_BLE_Init_2 */
  return;
}

SVCCTL_UserEvtFlowStatus_t SVCCTL_App_Notification( void *pckt )
{
  hci_event_pckt *event_pckt;
  evt_le_meta_event *meta_evt;
  hci_le_connection_complete_event_rp0 * connection_complete_event;
  evt_blue_aci *blue_evt;
  hci_le_advertising_report_event_rp0 * le_advertising_event;
  event_pckt = (hci_event_pckt*) ((hci_uart_pckt *) pckt)->data;
  hci_disconnection_complete_event_rp0 *cc = (void *) event_pckt->data;
  uint8_t result;
  uint8_t event_type, event_data_size;
  uint8_t adtype, adlength;

  switch (event_pckt->evt)
  {
    /* USER CODE BEGIN evt */

    /* USER CODE END evt */
    case EVT_VENDOR:
    {
      handleNotification.P2P_Evt_Opcode = PEER_DISCON_HANDLE_EVT;
      blue_evt = (evt_blue_aci*) event_pckt->data;
      /* USER CODE BEGIN EVT_VENDOR */

      /* USER CODE END EVT_VENDOR */
      switch (blue_evt->ecode)
      {
      /* USER CODE BEGIN ecode */

      /* USER CODE END ecode */

        case EVT_BLUE_GAP_PROCEDURE_COMPLETE:
        {
        /* USER CODE BEGIN EVT_BLUE_GAP_PROCEDURE_COMPLETE */

        /* USER CODE END EVT_BLUE_GAP_PROCEDURE_COMPLETE */
          aci_gap_proc_complete_event_rp0 *gap_evt_proc_complete = (void*) blue_evt->data;
          /* CHECK GAP GENERAL DISCOVERY PROCEDURE COMPLETED & SUCCEED */
          if (gap_evt_proc_complete->Procedure_Code == GAP_GENERAL_DISCOVERY_PROC
              && gap_evt_proc_complete->Status == 0x00)
          {
            /* USER CODE BEGIN GAP_GENERAL_DISCOVERY_PROC */
            BSP_LED_Off(LED_BLUE);
            /* USER CODE END GAP_GENERAL_DISCOVERY_PROC */
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// This part of the code find if a report_name match with an addr, if yes, the name is put in the array SCANNING_NAME
// After, it's just for the layout for the terminal
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
            for(int i = 0; i < INDEX_FOUND ; i++)
            {
            	for(int y = 0 ; y < index_tab ; y++)
            	{
				   if( SCANNING_REPORT_FOUND[i][0] == SCANNING_REPORT[y][0]
					&& SCANNING_REPORT_FOUND[i][1] == SCANNING_REPORT[y][1]
					&& SCANNING_REPORT_FOUND[i][2] == SCANNING_REPORT[y][2]
					&& SCANNING_REPORT_FOUND[i][3] == SCANNING_REPORT[y][3]
					&& SCANNING_REPORT_FOUND[i][4] == SCANNING_REPORT[y][4]
					&& SCANNING_REPORT_FOUND[i][5] == SCANNING_REPORT[y][5])
					{
					   for (int a = 0 ; a < 30 ; a++)
					   {
						   SCANNING_NAME[y][a]=SCANNING_NAME_FOUND[i][a];
					   }
					}
            	}
            }



            APP_DBG_MSG("-- GAP GENERAL DISCOVERY PROCEDURE_COMPLETED\n\r\n\r\n\r");
            APP_DBG_MSG("                                                    ------------------\n\r");
            APP_DBG_MSG("                                                  ||REPORT BLE SCANNER||\n\r");
            APP_DBG_MSG("                                                    ------------------\n\r\n\r");
            APP_DBG_MSG(" N |                         NAME                         |             ADDRESS             |       RSSI     |\n\r");

            for(int j = 0; j < index_tab ; j++)
            {
            	if (SCANNING_NAME[j] == 0)
            	{
            		break;
            	}
            	APP_DBG_MSG("%2d |", j);
            	APP_DBG_MSG("%30s                        |   ", SCANNING_NAME[j]);
            	for (int k = 0; k < 6; k++)
            	{
            		APP_DBG_MSG("%02X   ", SCANNING_REPORT[j][k]);
            	}
            	APP_DBG_MSG("|    %4i dBm    ", SCANNING_RSSI[j]);
            	APP_DBG_MSG("|\n\r");
            }
            index_tab_save = index_tab;
            //index_tab = 0; disable -> find other devices if we reclick one the SW1
            INDEX_FOUND = 0;

            APP_DBG_MSG("To which one you want to connect ? Or reclick on the button to find more devices \n\r");

            HW_UART_Receive_IT(hw_uart1, buff_which , sizeof(buff_which), rx_usartCallBack);


