thibautldz/BLE_Scanner/STM32_WPAN/App/app_ble.c
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// This part of the code find during the scan the name of every devices, if not -> UNKNOWN
// if a name device is found, his name is save in NAME_FOUND as well as his address in REPORT_FOUND
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
          int p = 0;
          while(p < event_data_size)
          {
        	 adlength = adv_report_data[p];
             adtype = adv_report_data[p + 1];
             if(adtype == 0x09)
             {
            	 int inclu = 0;
            	 for(int i = 0; i < INDEX_FOUND ; i++)
            	 {
            	 if(   le_advertising_event->Advertising_Report[0].Address[0] == SCANNING_REPORT_FOUND[i][0]
					&& le_advertising_event->Advertising_Report[0].Address[1] == SCANNING_REPORT_FOUND[i][1]
					&& le_advertising_event->Advertising_Report[0].Address[2] == SCANNING_REPORT_FOUND[i][2]
					&& le_advertising_event->Advertising_Report[0].Address[3] == SCANNING_REPORT_FOUND[i][3]
					&& le_advertising_event->Advertising_Report[0].Address[4] == SCANNING_REPORT_FOUND[i][4]
					&& le_advertising_event->Advertising_Report[0].Address[5] == SCANNING_REPORT_FOUND[i][5])
            	 {
            		 inclu = 1;
            	 }
            	 }
            	 if(inclu == 0)
            	 {
            		 for (int t = 0 ; t < adlength-1 ; t++)
            		 {
            			 SCANNING_NAME_FOUND[INDEX_FOUND][t] = (adv_report_data[p+2+t]);
            		 }

            	 	 for (int k = 0; k < 6; k++)
            	 	 {
            	 		 SCANNING_REPORT_FOUND[INDEX_FOUND][k] = le_advertising_event->Advertising_Report[0].Address[k];
            	 	 }
            	 	 INDEX_FOUND++;
            	 }
                 }
          p += adlength + 1;
          }
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// This part of the code find the new devices addr save in SCANNING_REPORT as well as the RSSI in SCANNING_RSSI
// We fix the maximum of devices at 40 and we check in a first time if the devices is not already in the REPORT array
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
          if (index_tab < 40)
          {
        	  int inclus = 0;
        	  for(int i = 0; i < index_tab ; i++)
        	  {
        		  if(  le_advertising_event->Advertising_Report[0].Address[0] == SCANNING_REPORT[i][0]
					&& le_advertising_event->Advertising_Report[0].Address[1] == SCANNING_REPORT[i][1]
        	        && le_advertising_event->Advertising_Report[0].Address[2] == SCANNING_REPORT[i][2]
        	  	    && le_advertising_event->Advertising_Report[0].Address[3] == SCANNING_REPORT[i][3]
        	  	    && le_advertising_event->Advertising_Report[0].Address[4] == SCANNING_REPORT[i][4]
        	  	    && le_advertising_event->Advertising_Report[0].Address[5] == SCANNING_REPORT[i][5])
        	        {
        			  inclus = 1;
        	        }
        	   }
        	   if(inclus == 0)
        	   {
        		   int8_t RSSI;
        		   RSSI = *(int8_t*) (adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data);
        	       SCANNING_RSSI[index_tab] = RSSI;

        	       for (int t = 0 ; t < 30 ; t++)
        	       {
        	    	   SCANNING_NAME[index_tab][t] = TAB_TEMPO[t];
        	       }

        	       for (int k = 0; k < 6; k++)
        	       {
        	    	   SCANNING_REPORT[index_tab][k] = le_advertising_event->Advertising_Report[0].Address[k];
        	       }
        	       index_tab++;
        	   }
          	}
        }

          break;

        /* USER CODE BEGIN META_EVT */

        /* USER CODE END META_EVT */

        default:
          /* USER CODE BEGIN subevent_default */

          /* USER CODE END subevent_default */
          break;

      }
    }
    break; /* HCI_EVT_LE_META_EVENT */

    /* USER CODE BEGIN EVENT_PCKT */

    /* USER CODE END EVENT_PCKT */

    default:
      /* USER CODE BEGIN evt_default */

      /* USER CODE END evt_default */
      break;
  }

  return (SVCCTL_UserEvtFlowEnable);
}

APP_BLE_ConnStatus_t APP_BLE_Get_Client_Connection_Status( uint16_t Connection_Handle )
{

  if (BleApplicationContext.BleApplicationContext_legacy.connectionHandle == Connection_Handle)
  {
    return BleApplicationContext.Device_Connection_Status;
  }
  return APP_BLE_IDLE;
}
/* USER CODE BEGIN FD */
void APP_BLE_Key_Button1_Action(void)
{
#if OOB_DEMO == 0 
      P2PC_APP_SW1_Button_Action();
#else 
      if(P2P_Client_APP_Get_State () != APP_BLE_CONNECTED_CLIENT)
      {
        UTIL_SEQ_SetTask(1 << CFG_TASK_START_SCAN_ID, CFG_SCH_PRIO_0);
      }
      else 
      {
        P2PC_APP_SW1_Button_Action();
      }   
#endif 
}

void APP_BLE_Key_Button2_Action(void)
{
}

void APP_BLE_Key_Button3_Action(void)
{
}
/* USER CODE END FD */
/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
static void Ble_Tl_Init( void )
{
  HCI_TL_HciInitConf_t Hci_Tl_Init_Conf;

  Hci_Tl_Init_Conf.p_cmdbuffer = (uint8_t*)&BleCmdBuffer;
  Hci_Tl_Init_Conf.StatusNotCallBack = BLE_StatusNot;
  hci_init(BLE_UserEvtRx, (void*) &Hci_Tl_Init_Conf);

  return;
}

 static void Ble_Hci_Gap_Gatt_Init(void){

  uint8_t role;
  uint8_t index;
  uint16_t gap_service_handle, gap_dev_name_char_handle, gap_appearance_char_handle;
  const uint8_t *bd_addr;
  uint32_t srd_bd_addr[2];
  uint16_t appearance[1] = { BLE_CFG_GAP_APPEARANCE };

  /**
   * Initialize HCI layer
   */
  /*HCI Reset to synchronise BLE Stack*/
   hci_reset();

   /**
   * Write the BD Address
   */

  bd_addr = BleGetBdAddress();
  aci_hal_write_config_data(CONFIG_DATA_PUBADDR_OFFSET,
                            CONFIG_DATA_PUBADDR_LEN,
                            (uint8_t*) bd_addr);

  /**
   * Static random Address
   * The two upper bits shall be set to 1
   * The lowest 32bits is read from the UDN to differentiate between devices
   * The RNG may be used to provide a random number on each power on
   */
  srd_bd_addr[1] =  0x0000ED6E;
  srd_bd_addr[0] =  LL_FLASH_GetUDN( );
  aci_hal_write_config_data( CONFIG_DATA_RANDOM_ADDRESS_OFFSET, CONFIG_DATA_RANDOM_ADDRESS_LEN, (uint8_t*)srd_bd_addr );

  /**
   * Write Identity root key used to derive LTK and CSRK
   */
    aci_hal_write_config_data( CONFIG_DATA_IR_OFFSET, CONFIG_DATA_IR_LEN, (uint8_t*)BLE_CFG_IR_VALUE );

   /**
   * Write Encryption root key used to derive LTK and CSRK
   */
    aci_hal_write_config_data( CONFIG_DATA_ER_OFFSET, CONFIG_DATA_ER_LEN, (uint8_t*)BLE_CFG_ER_VALUE );

  /**
     * Set TX Power to 0dBm.
     */
    aci_hal_set_tx_power_level(1, CFG_TX_POWER);

/**
   * Initialize GATT interface
   */
  aci_gatt_init();

  /**
   * Initialize GAP interface
   */
  role = 0;

